__author__ = "Виталий Варщук"

# Задача-1:
# Напишите скрипт, создающий директории dir_1 - dir_9 в папке,
# из которой запущен данный скрипт.
# И второй скрипт, удаляющий эти папки.

print("\nЗадание-1")

# Задача-2:
# Напишите скрипт, отображающий папки текущей директории.

print("\nЗадание-2")