__author__ = "Виталий Варщук"

# Задание-1
# Написать программу для распаковки файлов в корневую из всех
# папок с расширениями (код взять с урока) и папки удалить

print("\nЗадание-1")
