__author__ = "Виталий Варщук"

# Задание-1:
# Создать класс треугольник и реализовать в нем конструктор, методы для вычисления (не печати,
# нужен return) площади, периметра  и вывод значений сторон треугольника на экран.
# В конструкторе сделать проверку на возможность создания такого треугольника, если нет, то
# написать, что такой треугольник нельзя создать и сделать exit(1)

print("\nЗадание-1")

# Задание-2:
# Написать класс, который будет удобно использовать для работы с (на выбор что-нибудь одно)
# комплексными числами \ матрицами \ светофор \ микроволновка

print("\nЗадание-2")
